* DONE Implement parser for org-element-data in OCaml
CLOSED: [2022-11-22 Tue 11:04]
* DONE Write elisp code to remove parent properties 
CLOSED: [2022-11-23 Wed 09:57]
* DONE Write elisp code to get names of all org buffers
CLOSED: [2022-11-23 Wed 10:09]
* DONE Write elisp code to get last modified + changes timestamp for buffer for refreshing agenda view 
CLOSED: [2022-11-23 Wed 10:09]
Check out src_emacs[:exports code]{buffer-modified-tick} and src_emacs[:exports code]{visited-file-modtime}
* DONE On load to home, collect org buffer names, select first and redirect to =/buffer/buffer-name=
CLOSED: [2022-12-01 Thu 03:31]
* DONE Use parameter =/buffer/buffer-name= to collect buffer-name or redirect to first valid buffer name
CLOSED: [2022-12-01 Thu 03:31]
* DONE Render names of all buffers at top of website, on click take to respective page
CLOSED: [2022-12-01 Thu 03:31]
* DONE Render tasks in list
CLOSED: [2022-12-01 Thu 03:31]
* DONE Add on click of element fold
CLOSED: [2022-12-01 Thu 05:42]
* DONE Add filtering panel at top of screen                       :immediate:
CLOSED: [2022-12-01 Thu 10:16]
:LOGBOOK:
CLOCK: [2022-12-01 Thu 05:43]--[2022-12-01 Thu 05:44] =>  0:01
:END:
* DONE Add filter for completed tasks
CLOSED: [2022-12-01 Thu 11:30]
* DONE Add filter for clocked tasks
CLOSED: [2022-12-01 Thu 11:30]
* DONE Add button to show clock duration for tasks with active clock
CLOSED: [2022-12-01 Thu 12:22]
:LOGBOOK:
CLOCK: [2022-12-01 Thu 11:31]--[2022-12-01 Thu 12:22] =>  0:51
:END:
* DONE Add button to show folding
CLOSED: [2022-12-01 Thu 23:12]
** DONE Hide folding buttons on subsections empty 
CLOSED: [2022-12-01 Thu 23:12]
* DONE Fix buffer loading to keep current buffer
CLOSED: [2022-12-02 Fri 01:15]
:LOGBOOK:
CLOCK: [2022-12-02 Fri 01:13]--[2022-12-02 Fri 01:15] =>  0:02
:END:
* DONE Add button to open in emacs
CLOSED: [2022-12-02 Fri 01:35]
** DONE update server to have an endpoint that takes in buffer & timestamp - return none if no change
CLOSED: [2022-12-02 Fri 01:12]
** DONE Update reload button to reload
CLOSED: [2022-12-02 Fri 01:31]
** DONE refresh code on clock edge
CLOSED: [2022-12-02 Fri 01:35]
* TODO Add button to task to open-in-emacs, on click on button, send request to server, server send request to emacs
:LOGBOOK:
CLOCK: [2022-12-01 Fri 17:41]
:END:
** TODO write elisp code to open window to position
** TODO add endpoint to open in emacs
** TODO 
* TODO Add support to clock in
* TODO Add support to clock out
* DONE Show running tasks
CLOSED: [2022-12-01 Thu 13:02]
* DONE Add option to hide/show hidden tasks
CLOSED: [2022-12-01 Thu 13:02]
